DROP DATABASE IF EXISTS smart_closet;

CREATE DATABASE smart_closet;

USE smart_closet;

CREATE TABLE users(
    m_no INT AUTO_INCREMENT PRIMARY KEY,
    m_id VARCHAR(15) NOT NULL UNIQUE,
    m_pwd VARCHAR(15) NOT NULL
);

CREATE TABLE categories(
    c_no INT PRIMARY KEY,
    c_name VARCHAR(10) NOT NULL
);

CREATE TABLE clothes(
    cl_no INT AUTO_INCREMENT PRIMARY KEY,
    m_no INT NOT NULL,
    c_no INT NOT NULL,
    cl_color VARCHAR(50) NOT NULL,
    cl_name VARCHAR(50) NOT NULL,
    re_type VARCHAR(10),
    FOREIGN KEY(m_no) REFERENCES users(m_no),
    FOREIGN KEY(c_no) REFERENCES categories(c_no)
);

CREATE TABLE wearLog(
    w_no INT AUTO_INCREMENT PRIMARY KEY,
    cl_no INT NOT NULL,
    w_context DATE NOT NULL,
    FOREIGN KEY(cl_no) REFERENCES clothes(cl_no)
    ON DELETE CASCADE
);

INSERT INTO users(m_id, m_pwd) VALUES
('admin', '1234'),
('kafell', '141543'),
('ganatech', 'pw123'),
('topline', 'pw432'),
('sunnet', 'pw000'),
('wireguy', 'pw001'),
('junil', 'pw4321'),
('jinyoung', 'pw876'),
('datahero', 'pw555'),
('jhwang', 'pw789'),
('closet01', 'pw111'),
('fashion02', 'pw222'),
('style03', 'pw333'),
('daily04', 'pw444'),
('reuse05', 'pw555');

INSERT INTO categories(c_no, c_name) VALUES
(1101, '반팔티'),
(1102, '나시'),
(1201, '긴팔티'),
(1202, '니트'),
(1203, '맨투맨'),
(1204, '후드티'),
(1301, '셔츠'),
(1302, '블라우스'),
(2101, '반바지'),
(2301, '긴바지'),
(2302, '치마'),
(2303, '청바지'),
(2304, '슬랙스'),
(3101, '바람막이'),
(3201, '패딩'),
(3202, '코트'),
(3203, '가디건'),
(3204, '자켓'),
(3301, '후드집업'),
(4101, '샌들'),
(4201, '구두'),
(4202, '부츠'),
(4301, '운동화');

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(1, 1101, 'white', '흰색 반팔티', NULL),
(1, 1102, 'black', '검정 나시', NULL),
(1, 1201, 'navy', '네이비 긴팔티', NULL),
(1, 1202, 'gray', '회색 니트', NULL),
(1, 1203, 'black', '검정 맨투맨', NULL),
(1, 1204, 'beige', '베이지 후드티', NULL),
(1, 1301, 'white', '흰색 셔츠', NULL),
(1, 1302, 'skyblue', '하늘색 블라우스', NULL),
(1, 2101, 'black', '검정 반바지', NULL),
(1, 2301, 'beige', '베이지 긴바지', NULL),
(1, 2303, 'blue', '진청 청바지', NULL),
(1, 2304, 'gray', '회색 슬랙스', NULL),
(1, 3101, 'khaki', '카키 바람막이', NULL),
(1, 3201, 'black', '검정 패딩', NULL),
(1, 3202, 'brown', '브라운 코트', NULL),
(1, 3203, 'beige', '베이지 가디건', NULL),
(1, 3204, 'black', '검정 자켓', NULL),
(1, 3301, 'gray', '회색 후드집업', NULL),
(1, 4101, 'brown', '브라운 샌들', NULL),
(1, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(2, 1101, 'black', '검정 반팔티', NULL),
(2, 1102, 'navy', '네이비 나시', NULL),
(2, 1201, 'gray', '회색 긴팔티', NULL),
(2, 1202, 'navy', '네이비 니트', NULL),
(2, 1203, 'beige', '베이지 맨투맨', NULL),
(2, 1204, 'black', '검정 후드티', NULL),
(2, 1301, 'skyblue', '하늘색 셔츠', NULL),
(2, 1302, 'white', '화이트 블라우스', NULL),
(2, 2101, 'gray', '회색 반바지', NULL),
(2, 2301, 'black', '검정 긴바지', NULL),
(2, 2303, 'skyblue', '연청 청바지', NULL),
(2, 2304, 'navy', '네이비 슬랙스', NULL),
(2, 3101, 'black', '검정 바람막이', NULL),
(2, 3201, 'navy', '네이비 패딩', NULL),
(2, 3202, 'gray', '회색 코트', NULL),
(2, 3203, 'brown', '브라운 가디건', NULL),
(2, 3204, 'beige', '베이지 자켓', NULL),
(2, 3301, 'black', '검정 후드집업', NULL),
(2, 4201, 'black', '검정 구두', NULL),
(2, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(3, 1101, 'pink', '핑크 반팔티', NULL),
(3, 1102, 'black', '검정 나시', NULL),
(3, 1201, 'white', '흰색 긴팔티', NULL),
(3, 1202, 'beige', '베이지 니트', NULL),
(3, 1203, 'gray', '회색 맨투맨', NULL),
(3, 1204, 'pink', '핑크 후드티', NULL),
(3, 1301, 'white', '화이트 셔츠', NULL),
(3, 1302, 'skyblue', '하늘색 블라우스', NULL),
(3, 2101, 'black', '검정 반바지', NULL),
(3, 2301, 'beige', '베이지 긴바지', NULL),
(3, 2302, 'black', '검정 치마', NULL),
(3, 2303, 'skyblue', '연청 청바지', NULL),
(3, 2304, 'gray', '회색 슬랙스', NULL),
(3, 3101, 'khaki', '카키 바람막이', NULL),
(3, 3201, 'black', '검정 패딩', NULL),
(3, 3202, 'gray', '회색 코트', NULL),
(3, 3203, 'brown', '브라운 가디건', NULL),
(3, 3204, 'black', '검정 자켓', NULL),
(3, 4101, 'brown', '브라운 샌들', NULL),
(3, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(4, 1101, 'gray', '회색 반팔티', NULL),
(4, 1102, 'black', '검정 나시', NULL),
(4, 1201, 'black', '검정 긴팔티', NULL),
(4, 1202, 'navy', '네이비 니트', NULL),
(4, 1203, 'navy', '네이비 맨투맨', NULL),
(4, 1204, 'gray', '회색 후드티', NULL),
(4, 1301, 'white', '흰색 셔츠', NULL),
(4, 2101, 'navy', '네이비 반바지', NULL),
(4, 2301, 'black', '검정 긴바지', NULL),
(4, 2303, 'blue', '데님 청바지', NULL),
(4, 2304, 'gray', '회색 슬랙스', NULL),
(4, 3101, 'khaki', '카키 바람막이', NULL),
(4, 3201, 'black', '검정 패딩', NULL),
(4, 3202, 'brown', '브라운 코트', NULL),
(4, 3203, 'gray', '회색 가디건', NULL),
(4, 3204, 'black', '검정 자켓', NULL),
(4, 3301, 'navy', '네이비 후드집업', NULL),
(4, 4101, 'black', '검정 샌들', NULL),
(4, 4201, 'brown', '브라운 구두', NULL),
(4, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(5, 1101, 'white', '흰색 반팔티', NULL),
(5, 1102, 'black', '검정 나시', NULL),
(5, 1201, 'navy', '네이비 긴팔티', NULL),
(5, 1202, 'beige', '베이지 니트', NULL),
(5, 1203, 'gray', '회색 맨투맨', NULL),
(5, 1204, 'black', '검정 후드티', NULL),
(5, 1301, 'skyblue', '하늘색 셔츠', NULL),
(5, 1302, 'white', '흰색 블라우스', NULL),
(5, 2101, 'navy', '네이비 반바지', NULL),
(5, 2301, 'brown', '브라운 긴바지', NULL),
(5, 2303, 'blue', '진청 청바지', NULL),
(5, 2304, 'black', '검정 슬랙스', NULL),
(5, 3101, 'khaki', '카키 바람막이', NULL),
(5, 3201, 'black', '검정 패딩', NULL),
(5, 3202, 'gray', '회색 코트', NULL),
(5, 3203, 'beige', '베이지 가디건', NULL),
(5, 3204, 'brown', '브라운 자켓', NULL),
(5, 3301, 'gray', '회색 후드집업', NULL),
(5, 4202, 'black', '검정 부츠', NULL),
(5, 4301, 'white', '화이트 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(6, 1101, 'navy', '네이비 반팔티', NULL),
(6, 1102, 'gray', '회색 나시', NULL),
(6, 1201, 'black', '검정 긴팔티', NULL),
(6, 1202, 'gray', '회색 니트', NULL),
(6, 1203, 'black', '검정 맨투맨', NULL),
(6, 1204, 'navy', '네이비 후드티', NULL),
(6, 1301, 'white', '화이트 셔츠', NULL),
(6, 2101, 'black', '검정 반바지', NULL),
(6, 2301, 'beige', '베이지 긴바지', NULL),
(6, 2303, 'blue', '청바지', NULL),
(6, 2304, 'gray', '회색 슬랙스', NULL),
(6, 3101, 'black', '검정 바람막이', NULL),
(6, 3201, 'black', '검정 패딩', NULL),
(6, 3202, 'brown', '브라운 코트', NULL),
(6, 3203, 'navy', '네이비 가디건', NULL),
(6, 3204, 'gray', '회색 자켓', NULL),
(6, 3301, 'black', '검정 후드집업', NULL),
(6, 4101, 'brown', '브라운 샌들', NULL),
(6, 4201, 'black', '검정 구두', NULL),
(6, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(7, 1101, 'white', '화이트 반팔티', NULL),
(7, 1102, 'beige', '베이지 나시', NULL),
(7, 1201, 'navy', '네이비 긴팔티', NULL),
(7, 1202, 'brown', '브라운 니트', NULL),
(7, 1203, 'gray', '회색 맨투맨', NULL),
(7, 1204, 'black', '검정 후드티', NULL),
(7, 1301, 'skyblue', '하늘색 셔츠', NULL),
(7, 1302, 'white', '흰색 블라우스', NULL),
(7, 2101, 'black', '검정 반바지', NULL),
(7, 2301, 'navy', '네이비 긴바지', NULL),
(7, 2302, 'beige', '베이지 치마', NULL),
(7, 2303, 'blue', '진청 청바지', NULL),
(7, 2304, 'gray', '회색 슬랙스', NULL),
(7, 3101, 'khaki', '카키 바람막이', NULL),
(7, 3201, 'black', '검정 패딩', NULL),
(7, 3202, 'brown', '브라운 코트', NULL),
(7, 3203, 'beige', '베이지 가디건', NULL),
(7, 3204, 'black', '검정 자켓', NULL),
(7, 4202, 'black', '검정 부츠', NULL),
(7, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(8, 1101, 'black', '검정 반팔티', NULL),
(8, 1102, 'white', '흰색 나시', NULL),
(8, 1201, 'gray', '회색 긴팔티', NULL),
(8, 1202, 'navy', '네이비 니트', NULL),
(8, 1203, 'beige', '베이지 맨투맨', NULL),
(8, 1204, 'gray', '회색 후드티', NULL),
(8, 1301, 'white', '화이트 셔츠', NULL),
(8, 2101, 'navy', '네이비 반바지', NULL),
(8, 2301, 'black', '검정 긴바지', NULL),
(8, 2303, 'skyblue', '연청 청바지', NULL),
(8, 2304, 'black', '검정 슬랙스', NULL),
(8, 3101, 'khaki', '카키 바람막이', NULL),
(8, 3201, 'black', '블랙 패딩', NULL),
(8, 3202, 'gray', '회색 코트', NULL),
(8, 3203, 'brown', '브라운 가디건', NULL),
(8, 3204, 'navy', '네이비 자켓', NULL),
(8, 3301, 'gray', '회색 후드집업', NULL),
(8, 4101, 'black', '검정 샌들', NULL),
(8, 4201, 'brown', '브라운 구두', NULL),
(8, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(9, 1101, 'white', '흰색 반팔티', NULL),
(9, 1102, 'black', '검정 나시', NULL),
(9, 1201, 'navy', '네이비 긴팔티', NULL),
(9, 1202, 'gray', '회색 니트', NULL),
(9, 1203, 'black', '검정 맨투맨', NULL),
(9, 1204, 'beige', '베이지 후드티', NULL),
(9, 1301, 'skyblue', '하늘색 셔츠', NULL),
(9, 1302, 'white', '화이트 블라우스', NULL),
(9, 2101, 'black', '검정 반바지', NULL),
(9, 2301, 'brown', '브라운 긴바지', NULL),
(9, 2302, 'navy', '네이비 치마', NULL),
(9, 2303, 'blue', '청바지', NULL),
(9, 2304, 'gray', '회색 슬랙스', NULL),
(9, 3101, 'black', '검정 바람막이', NULL),
(9, 3201, 'black', '검정 패딩', NULL),
(9, 3202, 'brown', '브라운 코트', NULL),
(9, 3203, 'beige', '베이지 가디건', NULL),
(9, 3204, 'gray', '회색 자켓', NULL),
(9, 4202, 'black', '검정 부츠', NULL),
(9, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(10, 1101, 'gray', '회색 반팔티', NULL),
(10, 1102, 'navy', '네이비 나시', NULL),
(10, 1201, 'black', '검정 긴팔티', NULL),
(10, 1202, 'beige', '베이지 니트', NULL),
(10, 1203, 'navy', '네이비 맨투맨', NULL),
(10, 1204, 'black', '검정 후드티', NULL),
(10, 1301, 'white', '흰색 셔츠', NULL),
(10, 2101, 'black', '검정 반바지', NULL),
(10, 2301, 'gray', '회색 긴바지', NULL),
(10, 2303, 'blue', '진청 청바지', NULL),
(10, 2304, 'black', '검정 슬랙스', NULL),
(10, 3101, 'khaki', '카키 바람막이', NULL),
(10, 3201, 'black', '검정 패딩', NULL),
(10, 3202, 'gray', '회색 코트', NULL),
(10, 3203, 'brown', '브라운 가디건', NULL),
(10, 3204, 'black', '검정 자켓', NULL),
(10, 3301, 'navy', '네이비 후드집업', NULL),
(10, 4101, 'brown', '브라운 샌들', NULL),
(10, 4201, 'black', '검정 구두', NULL),
(10, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(11, 1101, 'white', '화이트 반팔티', NULL),
(11, 1102, 'black', '검정 나시', NULL),
(11, 1201, 'gray', '회색 긴팔티', NULL),
(11, 1202, 'navy', '네이비 니트', NULL),
(11, 1203, 'beige', '베이지 맨투맨', NULL),
(11, 1204, 'gray', '회색 후드티', NULL),
(11, 1301, 'skyblue', '하늘색 셔츠', NULL),
(11, 1302, 'white', '흰색 블라우스', NULL),
(11, 2101, 'navy', '네이비 반바지', NULL),
(11, 2301, 'black', '검정 긴바지', NULL),
(11, 2303, 'skyblue', '연청 청바지', NULL),
(11, 2304, 'gray', '회색 슬랙스', NULL),
(11, 3101, 'black', '검정 바람막이', NULL),
(11, 3201, 'black', '검정 패딩', NULL),
(11, 3202, 'brown', '브라운 코트', NULL),
(11, 3203, 'beige', '베이지 가디건', NULL),
(11, 3204, 'black', '검정 자켓', NULL),
(11, 3301, 'gray', '회색 후드집업', NULL),
(11, 4202, 'black', '검정 부츠', NULL),
(11, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(12, 1101, 'black', '검정 반팔티', NULL),
(12, 1102, 'white', '흰색 나시', NULL),
(12, 1201, 'navy', '네이비 긴팔티', NULL),
(12, 1202, 'brown', '브라운 니트', NULL),
(12, 1203, 'gray', '회색 맨투맨', NULL),
(12, 1204, 'black', '검정 후드티', NULL),
(12, 1301, 'white', '화이트 셔츠', NULL),
(12, 2101, 'gray', '회색 반바지', NULL),
(12, 2301, 'beige', '베이지 긴바지', NULL),
(12, 2303, 'blue', '청바지', NULL),
(12, 2304, 'black', '검정 슬랙스', NULL),
(12, 3101, 'khaki', '카키 바람막이', NULL),
(12, 3201, 'navy', '네이비 패딩', NULL),
(12, 3202, 'gray', '회색 코트', NULL),
(12, 3203, 'brown', '브라운 가디건', NULL),
(12, 3204, 'black', '검정 자켓', NULL),
(12, 3301, 'navy', '네이비 후드집업', NULL),
(12, 4101, 'brown', '갈색 샌들', NULL),
(12, 4201, 'black', '검정 구두', NULL),
(12, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(13, 1101, 'pink', '핑크 반팔티', NULL),
(13, 1102, 'black', '검정 나시', NULL),
(13, 1201, 'white', '흰색 긴팔티', NULL),
(13, 1202, 'beige', '베이지 니트', NULL),
(13, 1203, 'gray', '회색 맨투맨', NULL),
(13, 1204, 'navy', '네이비 후드티', NULL),
(13, 1301, 'white', '화이트 셔츠', NULL),
(13, 1302, 'skyblue', '하늘색 블라우스', NULL),
(13, 2101, 'black', '검정 반바지', NULL),
(13, 2301, 'brown', '브라운 긴바지', NULL),
(13, 2302, 'navy', '네이비 치마', NULL),
(13, 2303, 'skyblue', '연청 청바지', NULL),
(13, 2304, 'gray', '회색 슬랙스', NULL),
(13, 3101, 'khaki', '카키 바람막이', NULL),
(13, 3201, 'black', '검정 패딩', NULL),
(13, 3202, 'brown', '브라운 코트', NULL),
(13, 3203, 'beige', '베이지 가디건', NULL),
(13, 3204, 'black', '검정 자켓', NULL),
(13, 4202, 'black', '검정 부츠', NULL),
(13, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(14, 1101, 'white', '흰색 반팔티', NULL),
(14, 1102, 'gray', '회색 나시', NULL),
(14, 1201, 'navy', '네이비 긴팔티', NULL),
(14, 1202, 'gray', '회색 니트', NULL),
(14, 1203, 'black', '검정 맨투맨', NULL),
(14, 1204, 'beige', '베이지 후드티', NULL),
(14, 1301, 'skyblue', '하늘색 셔츠', NULL),
(14, 2101, 'black', '검정 반바지', NULL),
(14, 2301, 'beige', '베이지 긴바지', NULL),
(14, 2303, 'blue', '진청 청바지', NULL),
(14, 2304, 'black', '검정 슬랙스', NULL),
(14, 3101, 'khaki', '카키 바람막이', NULL),
(14, 3201, 'black', '검정 패딩', NULL),
(14, 3202, 'gray', '회색 코트', NULL),
(14, 3203, 'brown', '브라운 가디건', NULL),
(14, 3204, 'navy', '네이비 자켓', NULL),
(14, 3301, 'gray', '회색 후드집업', NULL),
(14, 4101, 'brown', '브라운 샌들', NULL),
(14, 4201, 'black', '검정 구두', NULL),
(14, 4301, 'white', '화이트 운동화', NULL);

INSERT INTO clothes(m_no, c_no, cl_color, cl_name, re_type) VALUES
(15, 1101, 'black', '검정 반팔티', NULL),
(15, 1102, 'white', '흰색 나시', NULL),
(15, 1201, 'gray', '회색 긴팔티', NULL),
(15, 1202, 'beige', '베이지 니트', NULL),
(15, 1203, 'navy', '네이비 맨투맨', NULL),
(15, 1204, 'black', '검정 후드티', NULL),
(15, 1301, 'white', '화이트 셔츠', NULL),
(15, 1302, 'skyblue', '하늘색 블라우스', NULL),
(15, 2101, 'navy', '네이비 반바지', NULL),
(15, 2301, 'black', '검정 긴바지', NULL),
(15, 2302, 'beige', '베이지 치마', NULL),
(15, 2303, 'blue', '청바지', NULL),
(15, 2304, 'gray', '회색 슬랙스', NULL),
(15, 3101, 'black', '검정 바람막이', NULL),
(15, 3201, 'black', '검정 패딩', NULL),
(15, 3202, 'brown', '브라운 코트', NULL),
(15, 3203, 'beige', '베이지 가디건', NULL),
(15, 3204, 'gray', '회색 자켓', NULL),
(15, 4202, 'black', '검정 부츠', NULL),
(15, 4301, 'white', '흰색 운동화', NULL);

INSERT INTO wearLog(cl_no, w_context) VALUES

(1, '2026-04-10'),
(1, '2026-05-01'),
(1, '2026-05-20'),
(1, '2026-06-10'),
(1, '2026-07-01'),
(1, '2026-07-15'),
(1, '2026-08-01'),
(1, '2026-08-10'),
(1, '2026-08-18'),

(2, '2026-06-03'),
(2, '2026-06-20'),
(2, '2026-07-12'),
(2, '2026-08-04'),

(4, '2026-05-11'),
(4, '2026-06-15'),
(4, '2026-07-19'),

(7, '2025-12-10'),
(7, '2026-01-14'),

(10, '2026-04-18'),
(10, '2026-05-22'),
(10, '2026-07-08'),
(10, '2026-08-14'),

(11, '2026-05-04'),
(11, '2026-06-11'),
(11, '2026-07-21'),

(14, '2025-11-22'),
(14, '2026-01-03'),

(18, '2026-06-01'),
(18, '2026-07-04'),
(18, '2026-08-11'),

(20, '2026-05-10'),
(20, '2026-05-28'),
(20, '2026-06-15'),
(20, '2026-07-02'),
(20, '2026-07-18'),
(20, '2026-08-05'),
(20, '2026-08-17'),


(21, '2026-05-02'),
(21, '2026-05-16'),
(21, '2026-06-03'),
(21, '2026-06-22'),
(21, '2026-07-05'),
(21, '2026-07-20'),
(21, '2026-08-08'),

(22, '2026-06-08'),
(22, '2026-07-14'),
(22, '2026-08-12'),

(24, '2026-04-03'),
(24, '2026-05-19'),
(24, '2026-07-03'),

(27, '2025-12-02'),
(27, '2026-01-20'),

(30, '2026-05-13'),
(30, '2026-06-17'),
(30, '2026-08-02'),

(32, '2026-05-01'),
(32, '2026-06-10'),
(32, '2026-07-13'),
(32, '2026-08-15'),

(35, '2025-11-30'),
(35, '2026-02-01'),

(38, '2026-06-18'),
(38, '2026-07-23'),
(38, '2026-08-10'),

(40, '2026-05-05'),
(40, '2026-05-25'),
(40, '2026-06-14'),
(40, '2026-07-06'),
(40, '2026-07-26'),
(40, '2026-08-16'),


(41, '2026-05-04'),
(41, '2026-05-21'),
(41, '2026-06-09'),
(41, '2026-06-24'),
(41, '2026-07-11'),
(41, '2026-07-28'),
(41, '2026-08-13'),

(43, '2026-06-11'),
(43, '2026-07-17'),
(43, '2026-08-07'),

(45, '2026-04-21'),
(45, '2026-06-04'),
(45, '2026-07-22'),

(47, '2025-11-19'),
(47, '2026-01-06'),

(50, '2026-05-15'),
(50, '2026-06-30'),
(50, '2026-08-09'),

(52, '2026-05-06'),
(52, '2026-06-13'),
(52, '2026-07-20'),
(52, '2026-08-17'),

(55, '2025-12-15'),
(55, '2026-02-10'),

(58, '2026-06-02'),
(58, '2026-07-08'),
(58, '2026-08-04'),

(60, '2026-05-07'),
(60, '2026-05-23'),
(60, '2026-06-18'),
(60, '2026-07-09'),
(60, '2026-07-29'),
(60, '2026-08-18'),


(61, '2026-05-03'),
(61, '2026-05-17'),
(61, '2026-06-06'),
(61, '2026-06-27'),
(61, '2026-07-15'),
(61, '2026-08-03'),
(61, '2026-08-16'),

(63, '2026-06-09'),
(63, '2026-07-12'),
(63, '2026-08-10'),

(65, '2026-04-07'),
(65, '2026-05-25'),
(65, '2026-07-01'),

(67, '2025-12-09'),
(67, '2026-01-17'),

(70, '2026-05-22'),
(70, '2026-06-19'),
(70, '2026-08-12'),

(72, '2026-05-08'),
(72, '2026-06-16'),
(72, '2026-07-18'),
(72, '2026-08-14'),

(75, '2025-11-21'),
(75, '2026-02-06'),

(78, '2026-06-12'),
(78, '2026-07-10'),
(78, '2026-08-05'),

(80, '2026-05-02'),
(80, '2026-05-20'),
(80, '2026-06-15'),
(80, '2026-07-07'),
(80, '2026-07-25'),
(80, '2026-08-15'),


(81, '2026-05-01'),
(81, '2026-05-18'),
(81, '2026-06-05'),
(81, '2026-06-21'),
(81, '2026-07-09'),
(81, '2026-07-24'),
(81, '2026-08-11'),

(83, '2026-06-07'),
(83, '2026-07-16'),
(83, '2026-08-08'),

(85, '2026-04-14'),
(85, '2026-05-29'),
(85, '2026-07-03'),

(87, '2025-11-18'),
(87, '2026-01-11'),

(90, '2026-05-13'),
(90, '2026-06-26'),
(90, '2026-08-06'),

(92, '2026-05-07'),
(92, '2026-06-17'),
(92, '2026-07-19'),
(92, '2026-08-17'),

(95, '2025-12-23'),
(95, '2026-02-11'),

(98, '2026-06-14'),
(98, '2026-07-14'),
(98, '2026-08-02'),

(100, '2026-05-06'),
(100, '2026-05-26'),
(100, '2026-06-12'),
(100, '2026-07-06'),
(100, '2026-07-27'),
(100, '2026-08-16'),


(101, '2026-05-02'),
(101, '2026-05-19'),
(101, '2026-06-08'),
(101, '2026-06-25'),
(101, '2026-07-12'),
(101, '2026-07-30'),
(101, '2026-08-14'),

(103, '2026-06-04'),
(103, '2026-07-15'),
(103, '2026-08-09'),

(105, '2026-04-16'),
(105, '2026-05-27'),
(105, '2026-07-05'),

(107, '2025-12-05'),
(107, '2026-01-22'),

(110, '2026-05-16'),
(110, '2026-06-20'),
(110, '2026-08-07'),

(112, '2026-05-09'),
(112, '2026-06-14'),
(112, '2026-07-21'),
(112, '2026-08-18'),

(115, '2025-11-25'),
(115, '2026-02-03'),

(118, '2026-06-11'),
(118, '2026-07-18'),
(118, '2026-08-06'),

(120, '2026-05-03'),
(120, '2026-05-24'),
(120, '2026-06-16'),
(120, '2026-07-08'),
(120, '2026-07-26'),
(120, '2026-08-15'),


(121, '2026-05-04'),
(121, '2026-05-22'),
(121, '2026-06-06'),
(121, '2026-06-23'),
(121, '2026-07-11'),
(121, '2026-07-29'),
(121, '2026-08-12'),

(123, '2026-06-02'),
(123, '2026-07-13'),
(123, '2026-08-05'),

(125, '2026-04-12'),
(125, '2026-05-30'),
(125, '2026-07-04'),

(127, '2025-12-11'),
(127, '2026-01-25'),

(130, '2026-05-14'),
(130, '2026-06-18'),
(130, '2026-08-10'),

(132, '2026-05-08'),
(132, '2026-06-15'),
(132, '2026-07-22'),
(132, '2026-08-16'),

(135, '2025-11-24'),
(135, '2026-02-05'),

(138, '2026-06-10'),
(138, '2026-07-17'),
(138, '2026-08-04'),

(140, '2026-05-05'),
(140, '2026-05-25'),
(140, '2026-06-13'),
(140, '2026-07-07'),
(140, '2026-07-28'),
(140, '2026-08-17'),


(141, '2026-05-03'),
(141, '2026-05-20'),
(141, '2026-06-07'),
(141, '2026-06-24'),
(141, '2026-07-10'),
(141, '2026-07-27'),
(141, '2026-08-13'),

(143, '2026-06-05'),
(143, '2026-07-14'),
(143, '2026-08-08'),

(145, '2026-04-19'),
(145, '2026-05-28'),
(145, '2026-07-02'),

(147, '2025-12-07'),
(147, '2026-01-18'),

(150, '2026-05-17'),
(150, '2026-06-22'),
(150, '2026-08-11'),

(152, '2026-05-10'),
(152, '2026-06-12'),
(152, '2026-07-19'),
(152, '2026-08-15'),

(155, '2025-11-29'),
(155, '2026-02-09'),

(158, '2026-06-16'),
(158, '2026-07-20'),
(158, '2026-08-07'),

(160, '2026-05-01'),
(160, '2026-05-21'),
(160, '2026-06-14'),
(160, '2026-07-06'),
(160, '2026-07-25'),
(160, '2026-08-18'),


(161, '2026-05-06'),
(161, '2026-05-23'),
(161, '2026-06-09'),
(161, '2026-06-28'),
(161, '2026-07-16'),
(161, '2026-08-03'),
(161, '2026-08-17'),

(163, '2026-06-03'),
(163, '2026-07-12'),
(163, '2026-08-09'),

(165, '2026-04-13'),
(165, '2026-05-24'),
(165, '2026-07-01'),

(167, '2025-12-14'),
(167, '2026-01-21'),

(170, '2026-05-18'),
(170, '2026-06-21'),
(170, '2026-08-08'),

(172, '2026-05-11'),
(172, '2026-06-18'),
(172, '2026-07-23'),
(172, '2026-08-16'),

(175, '2025-11-27'),
(175, '2026-02-08'),

(178, '2026-06-13'),
(178, '2026-07-15'),
(178, '2026-08-06'),

(180, '2026-05-02'),
(180, '2026-05-27'),
(180, '2026-06-17'),
(180, '2026-07-09'),
(180, '2026-07-30'),
(180, '2026-08-18'),


(181, '2026-05-04'),
(181, '2026-05-21'),
(181, '2026-06-10'),
(181, '2026-06-27'),
(181, '2026-07-13'),
(181, '2026-07-31'),
(181, '2026-08-15'),

(183, '2026-06-07'),
(183, '2026-07-18'),
(183, '2026-08-10'),

(185, '2026-04-17'),
(185, '2026-05-30'),
(185, '2026-07-05'),

(187, '2025-12-04'),
(187, '2026-01-16'),

(190, '2026-05-15'),
(190, '2026-06-19'),
(190, '2026-08-12'),

(192, '2026-05-09'),
(192, '2026-06-16'),
(192, '2026-07-21'),
(192, '2026-08-17'),

(195, '2025-11-23'),
(195, '2026-02-02'),

(198, '2026-06-12'),
(198, '2026-07-17'),
(198, '2026-08-05'),

(200, '2026-05-01'),
(200, '2026-05-26'),
(200, '2026-06-15'),
(200, '2026-07-08'),
(200, '2026-07-27'),
(200, '2026-08-16'),


(201, '2026-05-05'),
(201, '2026-05-22'),
(201, '2026-06-08'),
(201, '2026-06-26'),
(201, '2026-07-14'),
(201, '2026-08-01'),
(201, '2026-08-18'),

(203, '2026-06-06'),
(203, '2026-07-16'),
(203, '2026-08-11'),

(205, '2026-04-20'),
(205, '2026-05-29'),
(205, '2026-07-03'),

(207, '2025-12-08'),
(207, '2026-01-23'),

(210, '2026-05-13'),
(210, '2026-06-23'),
(210, '2026-08-09'),

(212, '2026-05-07'),
(212, '2026-06-17'),
(212, '2026-07-20'),
(212, '2026-08-14'),

(215, '2025-11-20'),
(215, '2026-02-07'),

(218, '2026-06-14'),
(218, '2026-07-19'),
(218, '2026-08-06'),

(220, '2026-05-02'),
(220, '2026-05-24'),
(220, '2026-06-18'),
(220, '2026-07-10'),
(220, '2026-07-29'),
(220, '2026-08-17'),


(221, '2026-05-03'),
(221, '2026-05-19'),
(221, '2026-06-05'),
(221, '2026-06-22'),
(221, '2026-07-11'),
(221, '2026-07-28'),
(221, '2026-08-13'),

(223, '2026-06-08'),
(223, '2026-07-14'),
(223, '2026-08-07'),

(225, '2026-04-15'),
(225, '2026-05-26'),
(225, '2026-07-02'),

(227, '2025-12-12'),
(227, '2026-01-19'),

(230, '2026-05-16'),
(230, '2026-06-20'),
(230, '2026-08-10'),

(232, '2026-05-10'),
(232, '2026-06-13'),
(232, '2026-07-22'),
(232, '2026-08-16'),

(235, '2025-11-26'),
(235, '2026-02-04'),

(238, '2026-06-11'),
(238, '2026-07-18'),
(238, '2026-08-05'),

(240, '2026-05-04'),
(240, '2026-05-25'),
(240, '2026-06-16'),
(240, '2026-07-07'),
(240, '2026-07-26'),
(240, '2026-08-18'),


(241, '2026-05-01'),
(241, '2026-05-18'),
(241, '2026-06-06'),
(241, '2026-06-24'),
(241, '2026-07-13'),
(241, '2026-08-02'),
(241, '2026-08-17'),

(243, '2026-06-04'),
(243, '2026-07-15'),
(243, '2026-08-09'),

(245, '2026-04-18'),
(245, '2026-05-28'),
(245, '2026-07-04'),

(247, '2025-12-03'),
(247, '2026-01-15'),
(250, '2026-05-14'),
(250, '2026-06-21'),
(250, '2026-08-08'),
(252, '2026-05-08'),
(252, '2026-06-15'),
(252, '2026-07-21'),
(252, '2026-08-15'),
(255, '2025-11-28'),
(255, '2026-02-06'),
(258, '2026-06-12'),
(258, '2026-07-16'),
(258, '2026-08-04'),
(260, '2026-05-05'),
(260, '2026-05-23'),
(260, '2026-06-14'),
(260, '2026-07-08'),
(260, '2026-07-27'),
(260, '2026-08-18'),
(261, '2026-05-02'),
(261, '2026-05-20'),
(261, '2026-06-07'),
(261, '2026-06-25'),
(261, '2026-07-12'),
(261, '2026-07-30'),
(261, '2026-08-16'),
(263, '2026-06-05'),
(263, '2026-07-17'),
(263, '2026-08-11'),
(265, '2026-04-11'),
(265, '2026-05-27'),
(265, '2026-07-01'),
(267, '2025-12-06'),
(267, '2026-01-20'),
(270, '2026-05-17'),
(270, '2026-06-19'),
(270, '2026-08-10'),
(272, '2026-05-09'),
(272, '2026-06-16'),
(272, '2026-07-23'),
(272, '2026-08-17'),
(275, '2025-11-22'),
(275, '2026-02-10'),
(278, '2026-06-13'),
(278, '2026-07-19'),
(278, '2026-08-06'),
(280, '2026-05-03'),
(280, '2026-05-24'),
(280, '2026-06-18'),
(280, '2026-07-09'),
(280, '2026-07-29'),
(280, '2026-08-15'),
(281, '2026-05-04'),
(281, '2026-05-21'),
(281, '2026-06-09'),
(281, '2026-06-26'),
(281, '2026-07-14'),
(281, '2026-08-01'),
(281, '2026-08-18'),
(283, '2026-06-03'),
(283, '2026-07-16'),
(283, '2026-08-08'),
(285, '2026-04-16'),
(285, '2026-05-29'),
(285, '2026-07-05'),
(287, '2025-12-01'),
(287, '2026-01-17'),
(290, '2026-05-15'),
(290, '2026-06-22'),
(290, '2026-08-11'),
(292, '2026-05-07'),
(292, '2026-06-14'),
(292, '2026-07-20'),
(292, '2026-08-16'),
(295, '2025-11-30'),
(295, '2026-02-05'),
(298, '2026-06-10'),
(298, '2026-07-18'),
(298, '2026-08-07'),
(300, '2026-05-01'),
(300, '2026-05-25'),
(300, '2026-06-17'),
(300, '2026-07-07'),
(300, '2026-07-28'),
(300, '2026-08-17');
UPDATE clothes SET re_type = '기부' WHERE cl_no = 3;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 8;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 14;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 19;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 22;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 27;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 34;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 39;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 43;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 48;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 55;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 59;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 62;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 69;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 74;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 78;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 84;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 89;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 95;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 99;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 102;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 108;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 114;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 119;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 123;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 129;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 135;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 138;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 144;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 149;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 154;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 160;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 162;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 168;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 175;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 179;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 183;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 190;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 194;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 198;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 204;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 209;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 215;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 219;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 222;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 228;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 234;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 240;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 243;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 249;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 255;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 258;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 264;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 269;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 274;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 279;
UPDATE clothes SET re_type = '기부' WHERE cl_no = 282;
UPDATE clothes SET re_type = '중고판매' WHERE cl_no = 288;
UPDATE clothes SET re_type = '나눔' WHERE cl_no = 294;
UPDATE clothes SET re_type = '폐기' WHERE cl_no = 299;


select
    cl.cl_no AS "의류번호(PK)",
    cl.cl_name AS '의류이름', 
    COUNT(w.w_no) AS '착용횟수',
    MAX(w.w_context) AS '마지막 착용',
    DATEDIFF(CURDATE(), MAX(w.w_context)) AS '미착용일'
    from users u inner join clothes cl on u.m_no = cl.m_no
    left join wearlog w on cl.cl_no = w.cl_no
    WHERE u.m_no = 1
    GROUP BY u.m_no, cl.cl_no, cl.cl_name;



-- RecycleDto select문
select
    cl.cl_no AS "의류번호(PK)",
    cl.cl_name AS '의류이름', 
    COUNT(w.w_no) AS '착용횟수',
    MAX(w.w_context) AS '마지막 착용',
    IFNULL(DATEDIFF(CURDATE(), MAX(w.w_context)), -1) AS '미착용일'
    from users u inner join clothes cl on u.m_no = cl.m_no
    left join wearlog w on cl.cl_no = w.cl_no
    WHERE u.m_no = 1
    GROUP BY u.m_no, cl.cl_no, cl.cl_name
    HAVING MAX(w.w_context) IS NULL OR DATEDIFF(CURDATE(), MAX(w.w_context)) >= 90;


-- ----------------------------------------
-- 장기 미착용 의류
-- ----------------------------------------

-- 최근 90일 이상 착용하지 않은 옷

-- 번호 - 의류 - 마지막 착용 - 미착용 기간

-- 3 - 회색 니트 - 2026-03-28 - 145일
-- 4 - 검정 셔츠 - 2026-05-03 - 109일

-- 관리할 의류 번호 >> 3


-- [회색 니트]

-- 착용횟수 - 2회
-- 마지막 착용 - 2026-03-28
-- 미착용 기간 - 145일

-- 이 옷을 어떻게 관리하시겠습니까?

-- 1. 계속 보관
-- 2. 기부
-- 3. 나눔
-- 4. 중고판매
-- 5. 의류 폐기